Wassertank_perforiert/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | OpenFOAM (Engys Edition):                                |
|   o   O   o      | Version: 2.1_engysEdition-1.0                            |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;
autoBlockMesh   false;
blockData (0.02 0);

geometry
{
 
   cylinder 
    {
        type searchableCylinder;
	point1 (0 0 -3);
	point2 (0 0 3);
        radius 0.5;
    }
    refinementBox 
    {
      type searchableBox;
        min (-1 -1 -3);
        max (8.0 1.0 3);
    }
   
}

castellatedMeshControls
{
    features        ( );
    refinementSurfaces
    {
       
     cylinder
        {
            // Surface-wise min and max refinement level
            level (3 3);

            // Optional specification of patch type (default is wall). No
            // constraint types (cyclic, symmetry) etc. are allowed.
            patchInfo
            {
                type wall;
               // inGroups (motorBikeGroup);
            }
        }    

    }
    refinementRegions
    {
      // refinementBox
      //  {
      //    mode inside;
      //   levels ((1E15 3));
      // }   
     
    }
 
    locationInMesh  ( -2.0 0.0 0.0 );

    // Include wrapper setup
    include "$FOAM_CONFIG/snappyMesh.castellated";
}

// Settings for the snapping.
snapControls
{
    // Per final patch (so not geometry!) the layer information
    featureEdges
    {
    }
 
    include "$FOAM_CONFIG/snappyMesh.snap";
}


addLayersControls
{
    layers
    {
        "cylinder.*"
        {
            nSurfaceLayers  10;
	    fch 0.002;
	    expansionRatio 1.2;
        }
     
       
      
       
    }
    relativeSizes   false;
    finalLayerThickness 0.4;
    expansionRatio 1.15;
    minThickness    0.2;
    featureAngleMerge 45;
    featureAngleTerminate 80;
    nRelaxIter      5;
    maxFaceThicknessRatio 2;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    maxLayerIter    30;
    growConvexEdge  true;
    growConcaveEdge true;
    growUpPatches   true;
    preBalance      false;
    layerRecovery   1;
}

include "$FOAM_CONFIG/snappyMesh.qualityDict";
include "$FOAM_CONFIG/snappyMesh.misc";

// ************************************************************************* //
