Wassertank_perforiert/system/fvSolution_Pimple
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
	//        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.01;
	smoother         GaussSeidel;
      cacheAgglomeration  true;
      nCellsInCoarsestLevel 10;
      agglomerator     faceAreaPair;
      mergeLevels      1;
    }

    p_rghFinal
    {
        solver           GAMG;
      tolerance        1e-6;
      relTol           0.0;
      smoother         GaussSeidel;
      cacheAgglomeration  true;
      nCellsInCoarsestLevel 10;
      agglomerator     faceAreaPair;
      mergeLevels      1;
      maxIter          200;

    }

    "(U|h|e|k|epsilon|R|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|e|k|epsilon|R|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
  //    momentumPredictor yes;
    nOuterCorrectors 50;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
}
relaxationFactors
{
  fields
    {
      p_rgh 0.3;
      p_rghFinal 1;
      
    }
    equations
    {
        "(U|h|e|k|epsilon|R|omega)"           0.3;
        "(U|h|e|k|epsilon|R|omega)Final"           1;
    }
}


// ************************************************************************* //
